; domain
(define (domain hanoi-domain)
  (:requirements :equality)
  (:predicates (disk ?x) (smaller ?x ?y) (on ?x ?y) (clear ?x))
  (:action move-disk
           :parameters (?disk ?below-disk ?new-below-disk)
           :precondition (and (disk ?disk)
                              (smaller ?disk ?new-below-disk)
                              (not (= ?new-below-disk ?below-disk))
                              (not (= ?new-below-disk ?disk))
                              (not (= ?below-disk ?disk))
                              (on ?disk ?below-disk)
                              (clear ?disk)
                              (clear ?new-below-disk))
           :effect (and (clear ?below-disk)
                        (on ?disk ?new-below-disk)
                        (not (on ?disk ?below-disk))
                        (not (clear ?new-below-disk)))))

; problem
(define (problem hanoi-3)
  (:domain hanoi-domain)
  (:objects p1 p2 p3 d1 d2 d3)
  (:init 	(smaller d1 p1) (smaller d2 p1) (smaller d3 p1) 
		(smaller d1 p2) (smaller d2 p2) (smaller d3 p2) 
		(smaller d1 p3) (smaller d2 p3) (smaller d3 p3) 
		(smaller d1 d2) (smaller d1 d3) 
		(smaller d2 d3) 
		(clear p1) (clear p2) (clear d1) 
		(disk d1) (disk d2) (disk d3) 
		(on d1 d2) (on d2 d3) (on d3 p3))
  (:goal (and (on d1 d2) (on d2 d3) (on d3 p1))))

; plan
1. (move-disk d1 d2 p1)
   deleted: (on d1 d2) (clear p1)
   added: (clear d2) (on d1 p1)
   goals met: 1 of 3
2. (move-disk d2 d3 p2)
   deleted: (on d2 d3) (clear p2)
   added: (clear d3) (on d2 p2)
   goals met: 0 of 3
3. (move-disk d1 p1 d2)
   deleted: (on d1 p1) (clear d2)
   added: (clear p1) (on d1 d2)
   goals met: 1 of 3
4. (move-disk d3 p3 p1)
   deleted: (on d3 p3) (clear p1)
   added: (clear p3) (on d3 p1)
   goals met: 2 of 3
5. (move-disk d1 d2 p3)
   deleted: (on d1 d2) (clear p3)
   added: (clear d2) (on d1 p3)
   goals met: 1 of 3
6. (move-disk d2 p2 d3)
   deleted: (on d2 p2) (clear d3)
   added: (clear p2) (on d2 d3)
   goals met: 2 of 3
7. (move-disk d1 p3 d2)
   deleted: (on d1 p3) (clear d2)
   added: (clear p3) (on d1 d2)
   goals met: 3 of 3
